Web/The_Web_Developer_Bootcamp_2024/002.An_Introduction_to_Web_Development/002.000.Notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-04-29 Tue 17:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Section 2: An Introduction to Web Development</title>
<meta name="author" content="Alfredo Mejia" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://cdn.jsdelivr.net/npm/bulma@1.0.4/css/bulma.min.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Section 2: An Introduction to Web Development</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3538461">Navigation</a></li>
<li><a href="#org57c295d">Resources</a></li>
<li><a href="#orgc843785">Notes</a>
<ul>
<li><a href="#org4ba343d">Section 2.1: What Matters In This Section?</a></li>
<li><a href="#org4fba1c8">Section 2.2: The Internet in 5 Minutes</a></li>
<li><a href="#org11788cb">Section 2.3: Intro to the Web</a></li>
<li><a href="#orgf24bb97">Section 2.4: The Request / Response Cycle</a></li>
<li><a href="#org7b9076b">Section 2.5: Front-End and Back-End</a></li>
<li><a href="#org651521e">Section 2.6: What do HTML / CSS / JS do?</a></li>
<li><a href="#org44c7f68">Section 2.7: Setting Up Our Development Environment</a></li>
</ul>
</li>
<li><a href="#org5f2d071">Keywords</a></li>
<li><a href="#org6a864c8">Questions</a></li>
<li><a href="#orgce91e34">Summary</a></li>
</ul>
</div>
</div>

<div id="outline-container-org3538461" class="outline-2">
<h2 id="org3538461">Navigation</h2>
<div class="outline-text-2" id="text-org3538461">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Nav</th>
<th scope="col" class="org-left">Title</th>
<th scope="col" class="org-left">Links</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Index</td>
<td class="org-left">Notes Home</td>
<td class="org-left">&vert; <a href="../../../index.html">html</a> &vert; <a href="../../../index.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Home</td>
<td class="org-left">The Web Developer Bootcamp 2024</td>
<td class="org-left">&vert; <a href="../000.Home.html">html</a> &vert; <a href="../000.Home.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/Web/The_Web_Developer_Bootcamp_2024">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Prev</td>
<td class="org-left">Section 1: Course Orientation</td>
<td class="org-left">&vert; <a href="../001.Course_Orientation/001.000.Notes.html">html</a> &vert; <a href="../001.Course_Orientation/001.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/Web/The_Web_Developer_Bootcamp_2024/001.Course_Orientation">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Next</td>
<td class="org-left">Section 3: HTML - The Essentials</td>
<td class="org-left">&vert; <a href="../003.HTML_The_Essentials/003.000.Notes.html">html</a> &vert; <a href="../003.HTML_The_Essentials/003.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/Web/The_Web_Developer_Bootcamp_2024/003.HTML_The_Essentials">github</a> &vert;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org57c295d" class="outline-2">
<h2 id="org57c295d">Resources</h2>
<div class="outline-text-2" id="text-org57c295d">
<p>
<a href="./002.An_Introduction_to_Web_Development_Slides.pdf">Section 2: An Introduction to Web Development Slides</a>
</p>
</div>
</div>

<div id="outline-container-orgc843785" class="outline-2">
<h2 id="orgc843785">Notes</h2>
<div class="outline-text-2" id="text-orgc843785">
</div>
<div id="outline-container-org4ba343d" class="outline-3">
<h3 id="org4ba343d">Section 2.1: What Matters In This Section?</h3>
<div class="outline-text-3" id="text-org4ba343d">
<ul class="org-ul">
<li>Each section will have a "what matters" video at the beginning</li>
<li>The crucial part of this section is understanding the difference between html, css, and js</li>
<li>Important topics (but not crucial) is understanding the web, how the internet works, and HTTP request / response cycle</li>
</ul>
</div>
</div>

<div id="outline-container-org4fba1c8" class="outline-3">
<h3 id="org4fba1c8">Section 2.2: The Internet in 5 Minutes</h3>
<div class="outline-text-3" id="text-org4fba1c8">
<ul class="org-ul">
<li>The internet is basically just many connected devices (computers)</li>
<li>If we were to connect every computer with every other computer this would not be scalable to what we have now</li>
<li>Instead, routing is used, where one computer connects to another computer (router) and the router's job is to essentially route the connection from the sender to the sendee</li>
<li>Each computer are identified by IP addresses so the router knows where to connect you to</li>
<li>The internet are essentially networks on networks where you are routed to another computer and that computer is part of another network and route connections as well</li>
<li>Data is sent over cables in the internet, your wifi rotuer is connected to a modem and that modem to connected to a internet provider cable which eventually meet other cables and other computers</li>
<li>The sea cables of the internet use light more specifically electrons to transmit data (but that is too low level for us)</li>
<li>In summary, the intenet is a global network of networks, there are computers (servers), cables, and more to form the internet and connect various computers are connected with each other and transmit data to each other</li>
</ul>
</div>
</div>

<div id="outline-container-org11788cb" class="outline-3">
<h3 id="org11788cb">Section 2.3: Intro to the Web</h3>
<div class="outline-text-3" id="text-org11788cb">
<ul class="org-ul">
<li>The internet is the infrastructure that enables many things like emails, the web, streaming services, online gaming, etc</li>
<li>The web is just a part of what the internet transmits throughout the cables</li>
<li>The web (world wide web) is an information system where documents and others resources are available over the internet</li>
<li>These documents and resources are identified by URLs (uniform resource locators)</li>
<li>Documents and resources are transferred through the web (internet) through a protocol called http (hyper text transfer protocol)</li>
<li>HTTP is the foundation of how the world wide web works and communicates</li>
<li>HTTP is protocol which set rules on how the communication between computers should work</li>
<li>HTTP is just one protocol but the internet uses a whole stack of protocols like TCP/IP protocol and HTTP is just one protocol in that stack</li>
<li>So how does HTTP work? When a URL is visited, a request is created for a particular resource and eventually a server responds to the request by providing the resource requested</li>
<li>The browser then gets these resources and renders the webpage to the user</li>
<li>There are different types of server but in our case we are concerned with web servers who's sole purpose is to satisfy web requests</li>
<li>Thus, HTTP is a protocol to share resources between computers (client and server)</li>
<li>The web server can make sure the request (client) has necessary permissions, the resource exists, and any other rules implented in the web server</li>
<li>The client is any program / computer requesting a resource thus a browser is a client program</li>
<li>The server side is anything done in the web server like the rules, sending the resource, etc</li>
</ul>
</div>
</div>

<div id="outline-container-orgf24bb97" class="outline-3">
<h3 id="orgf24bb97">Section 2.4: The Request / Response Cycle</h3>
<div class="outline-text-3" id="text-orgf24bb97">
<ul class="org-ul">
<li>The browser sends a HTTP request, the web server responds with a web page (by sending the documents over to the client), and then the browser renders the documents and thus displays the web page</li>
<li>The server responds with documents and the documents are basically "instructions" for the browser to render for the user</li>
<li>What are these documents? What are these instructions? The documents are the HTML files, CSS files, and JS files</li>
<li>Whenever you search in google, you send a request <code>google.com/search?q=chickens</code> to Google's servers; Google's servers do some logic in the backend and then responds with HTML, CSS, and JS files</li>
</ul>
</div>
</div>

<div id="outline-container-org7b9076b" class="outline-3">
<h3 id="org7b9076b">Section 2.5: Front-End and Back-End</h3>
<div class="outline-text-3" id="text-org7b9076b">
<ul class="org-ul">
<li>There are two types of jobs: front-end and back-end</li>
<li>The back-end is the code and logic happening in the back-end servers (e.g. when you give google a query it has to figure out the links it needs to display, rank pages, figure out which ads to display, etc. that is the back-end code)</li>
<li>The front-end is the code returned by the server which includes HTML, CSS, and JS</li>
<li>Front-end development focuses what is run in the browser (HTML, CSS, and JS)</li>
<li>Back-end development focuses what is run in the back-end and it can Java, C++, C, Python and other technologies</li>
<li>The browser renders the front-end code to display the web page</li>
</ul>
</div>
</div>

<div id="outline-container-org651521e" class="outline-3">
<h3 id="org651521e">Section 2.6: What do HTML / CSS / JS do?</h3>
<div class="outline-text-3" id="text-org651521e">
<ul class="org-ul">
<li>The browser only understands HTML, CSS, and JS</li>
<li>HTML is the what, the content, it describes the things (buttons, headers, etc.)</li>
<li>CSS describes HTML elements, it helps visualize HTML elements (fonts, colors, styling etc.)</li>
<li>JS describes the what the HTML elements do, the actions and interactions (the logic, click this what should it do, search and autocomplete, etc.)</li>
</ul>
</div>
</div>

<div id="outline-container-org44c7f68" class="outline-3">
<h3 id="org44c7f68">Section 2.7: Setting Up Our Development Environment</h3>
<div class="outline-text-3" id="text-org44c7f68">
<ul class="org-ul">
<li>Download Chrome</li>
<li>VS Code</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org5f2d071" class="outline-2">
<h2 id="org5f2d071">Keywords</h2>
<div class="outline-text-2" id="text-org5f2d071">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Term</th>
<th scope="col" class="org-left">Definition</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>Router</b></td>
<td class="org-left">A computer that routes connections between computers</td>
</tr>

<tr>
<td class="org-left"><b>IP Address</b></td>
<td class="org-left">A unique identifier for a computer</td>
</tr>

<tr>
<td class="org-left"><b>URLs</b></td>
<td class="org-left">Uniform resource locators, a special string that identifies resources</td>
</tr>

<tr>
<td class="org-left"><b>HTTP Protocol</b></td>
<td class="org-left">A protocol (set of rules) that establishes the way communication occurs between computers from a web client and a web server</td>
</tr>

<tr>
<td class="org-left"><b>Client</b></td>
<td class="org-left">A program / user sending a request or asking for some type of resource</td>
</tr>

<tr>
<td class="org-left"><b>Web Server</b></td>
<td class="org-left">A program awaiting for requests to fulfill and respond with the necessary documents / resources asked by the client</td>
</tr>

<tr>
<td class="org-left"><b>HTML Files</b></td>
<td class="org-left">This displays the content of the page</td>
</tr>

<tr>
<td class="org-left"><b>CSS Files</b></td>
<td class="org-left">Changes the looks of the HTML elements</td>
</tr>

<tr>
<td class="org-left"><b>JS Files</b></td>
<td class="org-left">Adds behavior / functionality / interaction to the HTML elements</td>
</tr>

<tr>
<td class="org-left"><b>Front-End</b></td>
<td class="org-left">Code in the form of HTML, CSS, and JS, this is what the browser renders</td>
</tr>

<tr>
<td class="org-left"><b>Back-End</b></td>
<td class="org-left">Code that is ran in the web server and this can be Java, C++, C, Python, etc</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org6a864c8" class="outline-2">
<h2 id="org6a864c8">Questions</h2>
<div class="outline-text-2" id="text-org6a864c8">
<ul class="org-ul">
<li><b>Q</b>: Do browsers only process HTML, CSS, and JS files?
<ul class="org-ul">
<li>Yes, other frameworks and languages (if any) are compiled into HTML, CSS, and JS so the browser can render the web page</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgce91e34" class="outline-2">
<h2 id="orgce91e34">Summary</h2>
<div class="outline-text-2" id="text-orgce91e34">
<ul class="org-ul">
<li>The internet is just networks of networks</li>
<li>Routers help "route" connections between computers to establish the necessary connection</li>
<li>Data is transferred between computers through wires</li>
<li>The internet is the infrastructure that enables many things like gaming, streaming services, and world wide web</li>
<li>The web is an information system where documents and other resources are shared between clients and web servers</li>
<li>HTTP protocol is the protocol used to transfer data between web clients and web servers; it starts with a HTTP request and then web server sends the data back using HTTP</li>
<li>The client is any program asking for a resource with a request (e.g. browser sends a HTTP request) and the web server receives the request, processes it, and sends some resource / documents back</li>
<li>Front-end is the development that runs in the browser like the HTML, CSS, and JS</li>
<li>Back-end is the developement that runs in the web server, like what is the client asking for, what does it need to send back, etc. and this can be done in Java, C++, C, Python, etc</li>
<li>HTML is the content of the page, CSS is how the content looks, and JS is what does the content do</li>
</ul>
</div>
</div>
</div>
</body>
</html>
